---
kind: type
id: T:Autodesk.Revit.DB.ExportEnergyModelType
source: html/a5e9c660-febe-e1c0-af58-47a55bde5443.htm
---
# Autodesk.Revit.DB.ExportEnergyModelType

This enum is used to define if energy model used for gbXML export should be based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.

## Syntax (C#)
```csharp
public enum ExportEnergyModelType
```